// Προγραμμα που να οριζει ακτεινα ενος κυκλου r = 10.0
// να υπολογιζει και να εμφιζει  την περιφερια (2πr) και το εμβαδον του (πr^2)
// η τιμη το π να δηλωθει σταθερα π=3.14159

#include <stdio.h>

#define PI 3.14159

int main() {
	double r = 10.0;
	double circumference = 2 * PI * r;
	double area = PI * r * r;

	printf("Η περιφέρεια του κύκλου είναι: %.3f\n", circumference);
	printf("Το εμβαδόν του κύκλου είναι: %.2f\n", area);

	// 4 μεταβλητεσ int με τιμες 13, 48, 56, 24. Στην συνεχεια να υπολογιστει ο μεσος ορος τους και να εμφανιστει στην οθονη
	int a = 13, b = 48, c = 56, d = 24;
	double average = (a + b + c + d) / 4.0;

	printf("Ο μέσος όρος των αριθμών είναι: %.2f\n", average);

	return 0;
}

